Autodesk.Revit.DB.Location.Rotate(Autodesk.Revit.DB.Line,System.Double)
Rotate the element within the project by a specified angle around a given axis.
axis: An unbounded line that represents the axis of rotation.
angle: The angle, in radians, by which the element is to be rotated around the specified axis.
Returns: If the element is rotate successfully then the method returns True, otherwise False.
Remarks: The rotate method is used to rotate an element within the project. Other elements may also
be rotated when this element is rotated because they are dependent upon the element being rotated. An
unbounded line for the axis can be created by using the Application.Create object and its methods.

Autodesk.Revit.DB.Location.Move(Autodesk.Revit.DB.XYZ)
Move the element within the project by a specified vector.
translation: The vector by which the element is to be moved.
Returns: If the element is moved successfully then the method return True, otherwise False.
Remarks: The move method is used to move an element within the project. Other elements may also be
moved when this element is moved, for example: if the element is wall and it contains windows, the
windows will also be moved.

Autodesk.Revit.DB.Location
Provides location functionality for all elements.
Remarks: The location object provides the ability to translate and rotate elements. More
detailed location information and control can be found by using the derivatives of this
object, such as LocationPoint or LocationCurve.